<script setup></script>

<template>
  <div class="flex flex-col gap-5">
    <h1 class="text-3xl font-bold">데이터 모델링</h1>
    <p class="mt-2">
      <strong class="text-xl">모델링이란?</strong>
      <br />
      데이터를 저장할 일이 생겼을 때 DB를 설계할 것이고, 그에 맞는 요구사항이 있을텐데 <br />
      현실의 데이터를 추상화(상상)하여 데이터베이스에 저장하기 위한 설계 과정이다. <br />
    </p>

    <p>
      <strong class="text-xl">모델링 특징</strong>
      <br />
      1. 단순화 : 불필요한 세부 사항을 제거하여 핵심 개념에 집중한다. <br />
      2. 추상화 : 정해진 양식에 맞게 현실에 맞는 형식을 맞춰 간략하게 제작한다. <br />
      3. 명확화 : 애매모호한 부분을 제거하고 명확하고 정확하게 현상을 기술한다.
    </p>

    <p>
      <strong class="text-xl">모델링 관점</strong>
      <br />
      1. 데이터 관점 : 업무 고려하지 않고 데이터만 고려한다. <br />
      2. 프로세스 관점 : 작업과 수행을 고려해 업무적으로 설계를 바라본다. <br />
      3. 데이터와 프로세스 관점 : 어떤 상황에서 어떤 데이터가 필요한지 생각하는 단계.
    </p>

    <p>
      <strong class="text-xl">모델링 유의점</strong>
      <br />
      1. 중복 : 같은 정보가 저장되면 저장 공간의 낭비다. <br />
      2. 비유연성 : 사소한 변화에 구조가 변하면 안된다. 간단하게 추가되어야 한다. <br />
      3. 비일관성 : 상황에 따라 다른 데이터가 저장/불러오기 되면 안된다. 항상 모순이 없어야 한다.
    </p>

    <p>
      <strong class="text-xl">모델링 요소</strong>
      <br />
      대상 : 업무가 관리하고자 하는 대상 <br />
      속성 : 대상들이 갖는 속성 <br />
      관계 : 대상들 간의 관계
    </p>

    <p>
      <strong class="text-xl">데이터 모델링 3단계</strong>
      <br />
      1단계 : 개념적 모델링 (추상화 수준이 가장 높음. 업무 파악 후 언터티 추출하는 단계. ERD 작성)
      <br />
      2단계 : 논리적 모델링 (개념적 모델링을 바탕으로 데이터의 구조와 관계를 정의하는 단계. 정규화 수행)
      <br />
      3단계 : 물리적 모델링 (논리적 모델링을 바탕으로 실제 데이터베이스에 구현하기 위한 단계. 테이블, 인덱스 설계)
    </p>
  </div>
</template>
