<script setup></script>
<template>
  <div class="flex flex-col gap-5">
    <h1 class="text-3xl font-bold">Database</h1>
    <p class="mt-4">
      <strong>데이터베이스(DB, Database)</strong>는 데이터를 체계적으로 저장, 관리, 검색하기 위해 만들어진 <strong>데이터의 집합</strong>이다. <br />
      수작업으로 데이터를 관리할 때의 비효율성을 해결하기 위해 개발되었으며, <br />
      이를 관리하는 시스템을 DBMS(데이터베이스 관리 시스템)라고 부른다.
    </p>

    <p>데이터베이스에서 표는 <strong>테이블(엔터티)</strong>라고 불리며, 데이터를 구조화한 기본 단위이다.</p>

    <p>
      열(속성, 컬럼): 특정 데이터의 유형을 정의한다. <br />
      예를 들어, "성별" 속성은 '남성' 또는 '여성' 값만 가질 수 있다. <br />
      속성은 다시말해 여러 자료들을 하나의 개념으로 묶을 수 있는 기준이 된다.
    </p>

    <p>
      행(튜플): 테이블 내의 단일 데이터 단위를 의미한다. <br />
      예를 들어, "학생" 테이블에서 한 행은 특정 학생의 정보를 나타낸다. <br />
      튜플은 속성의 값에 맞게 채워진 가로줄로, 하나의 개별 데이터이다. 순서는 상관없으며 중복되지 않는다.
    </p>

    <p>
      카디널리티: 테이블에 포함된 행의 수를 의미한다. (가로 행이 몇개인가)
      <br />
      차수: 테이블에서 열이 몇 개인지 의미한다. (세로 열이 몇개인가)
      <br />
      도메인: 속성에 맞게 들어가는 값. (예: "성별" 속성의 도메인은 '남성', '여성')
      <br />
      인스턴스: 특정 시점에서 테이블에 저장된 행들의 집합을 가리킨다. (속성 제외한 모든 행)
    </p>
  </div>
</template>
